# 4) Определить, позицию второго вхождения строки в списке либо сообщить, что её нет.
# Примеры
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

from collections import defaultdict as sec_entires
lst = ["for", "if", "no", "else", "while", "try", "if", "elif"]

sec_str =  sec_entires(list)
for i, e in enumerate(lst):
    sec_str[e].append(i)
print(sec_str[e])

